모두의 연구소, 2024 AI 코칭스터디 팀 활동을 통해 정리한 내용입니다.  
- 로롱코치_6팀 : @엔터6(변찬우)

https://www.slideshare.net/wesm/pandas-powerful-data-analysis-tools-for-python

# **Pandas**

- Subclass of numpy.ndarray
- 구조화된 데이터의 처리를 지원하는 python 라이브러리이다. 
- Python 계의 엑셀과 같다고 할 수 있다.

관련 용어
- Dataframe : 전체 데이터(Table)
    - 2차원 매트릭스 
    - Series가 모여서 만들어짐
    - NumPy array-like
    - Each column can have a different type
    - Row and column index
    - Size mutable: insert and delete columns

- Series : 하나의 Column, 
    - column vector 하나를 표현하는 object. 
    - list 형태. index, data, data type으로 구성   

- Index : 숫자뿐만아니라 문자열도 가능. 중독될 수 있다.

In [9]:
from pandas import Series, DataFrame
import pandas as pd
import  numpy as np

1. 데이터 로드

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data' #Data URL
# data_url = './housing.data' #Data URL
df_data = pd.read_csv(data_url, sep='\s+', header = None) #csv 타입 데이터 로드, separate는 빈공간으로 지정하고, Column은 없음

<>:3: SyntaxWarning: invalid escape sequence '\s'
<>:3: SyntaxWarning: invalid escape sequence '\s'
/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/1836513762.py:3: SyntaxWarning: invalid escape sequence '\s'
  df_data = pd.read_csv(data_url, sep='\s+', header = None) #csv 타입 데이터 로드, separate는 빈공간으로 지정하고, Column은 없음

In [3]:
df_data.head() #처음 다섯줄 출력

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [4]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
# Column Header 이름 지정
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [5]:
type(df_data.values)

numpy.ndarray

2. Series

- 별도로 Index를 지정하지 않을 경우,

In [12]:
list_data = [1,2,3,4,5]
example_obj=Series(data=list_data)

example_obj # index를 따로 지정하지 않으면 0-base로 자동 생성된다.
        # index(왼쪽 리스트), data(오른쪽 리스트),data type 으로 출력

0    1
1    2
2    3
3    4
4    5
dtype: int64

- 별도로 Index를 지정한 경우,

In [19]:
list_name = ['a', 'b', 'c', 'd', 'e'] 
list_name

example_obj = Series(data = list_data, index=list_name) 
example_obj # 지정해준대로 list의 index가 생성되는 것을 확인할 수 있다.

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(dict_data, dtype=np.float32, name="example_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

- series의 값(data) 출력 
    - '1'을 출력하고 싶다면 index로 접근하면 된다
    - index가 0-base의 숫자가 아닌 문자열로도 지정이 가능하다

In [14]:
example_obj['a']

1

In [21]:
example_obj["a"] = 3.2
example_obj

/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/4086657177.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '3.2' has dtype incompatible with float32, please explicitly cast to a compatible dtype first.
  example_obj["a"] = 3.2

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float64

3. Dict Data를 Pandas로 변환

In [28]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [29]:
df = pd.DataFrame(raw_data, columns = ['age', 'city'])
df

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [30]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])

df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [37]:
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city','new'])

df # 새로운 컬럼을 추가하면 해당 series 값은 NaN으로 쓰인다

  first_name last_name  age           city  new
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

4. Series 데이터 추출하기

In [31]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [32]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

데이터 접근방법
- loc : index location : 인텍스의 '이름'을 기준으로 row값을 가져옮 
- iloc : index position : 인텍스의 '위치'를 기준으로 접근

In [46]:
s = pd.Series(np.nan, index=(49,48,47,46,45, 1, 2, 3, 4, 51))
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
51   NaN
dtype: float64

In [49]:
s.loc[:1] # index '이름'까지

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
dtype: float64

In [50]:
s.iloc[:1] # 컬럼 '위치'까지

49   NaN
dtype: float64

In [41]:
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
new                 NaN
Name: 1, dtype: object

In [39]:
df.iloc[1:] #컬럼(시리즈) 데이터의 위치(1번째)부터 가져옮

  first_name last_name  age       city  new
1      Molly  Jacobson   52  Baltimore  NaN
2       Tina       Ali   36      Miami  NaN
3       Jake    Milner   24    Douglas  NaN
4        Amy     Cooze   73     Boston  NaN

In [44]:
df['age'].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [34]:
df.loc[:, 'last_name'] # series로 추출

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [35]:
df.loc[:, ['last_name']] # dataframe으로 추출

  last_name
0    Miller
1  Jacobson
2       Ali
3    Milner
4     Cooze

5. 새로운 데이터 할당

In [61]:
df['elderly'] = df.age > 50

df

  first_name last_name  age           city  new  elderly
0      Jason    Miller   42  San Francisco  NaN    False
1      Molly  Jacobson   52      Baltimore  NaN     True
2       Tina       Ali   36          Miami  NaN    False
3       Jake    Milner   24        Douglas  NaN    False
4        Amy     Cooze   73         Boston  NaN     True

In [52]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
new                   NaN        NaN    NaN      NaN     NaN
elderly             False       True  False    False    True

In [53]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', nan, False],
       ['Molly', 'Jacobson', 52, 'Baltimore', nan, True],
       ['Tina', 'Ali', 36, 'Miami', nan, False],
       ['Jake', 'Milner', 24, 'Douglas', nan, False],
       ['Amy', 'Cooze', 73, 'Boston', nan, True]], dtype=object)

In [54]:
df.to_csv()

',first_name,last_name,age,city,new,elderly\n0,Jason,Miller,42,San Francisco,,False\n1,Molly,Jacobson,52,Baltimore,,True\n2,Tina,Ali,36,Miami,,False\n3,Jake,Milner,24,Douglas,,False\n4,Amy,Cooze,73,Boston,,True\n'

In [62]:
df.drop('new', axis=1)

  first_name last_name  age           city  elderly
0      Jason    Miller   42  San Francisco    False
1      Molly  Jacobson   52      Baltimore     True
2       Tina       Ali   36          Miami    False
3       Jake    Milner   24        Douglas    False
4        Amy     Cooze   73         Boston     True

In [63]:
del df['elderly']

df

  first_name last_name  age           city  new
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

Selection & Drop

In [66]:
pop = {
        'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.67}
    }

df=pd.DataFrame(pop)
df

      Nevada  Ohio
2001     2.4  1.70
2002     2.9  3.67
2000     NaN  1.50

In [74]:
!pip install xlrd openpyxl

Requirement already satisfied: xlrd in /Users/chanwoo/.venvs/aienv/lib/python3.12/site-packages (2.0.1)
Collecting openpyxl
  Downloading openpyxl-3.1.3-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.3-py2.py3-none-any.whl (251 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 251.3/251.3 kB 2.1 MB/s eta 0:00:0000:0100:01
Using cached et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.3

In [95]:
df = pd.read_excel("temp/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [79]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [80]:
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [76]:
df["account"].head(3) #Series Object

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [77]:
df[["account"]].head(3) #data frame object

   account
0   211829
1   320563
2   648336

In [87]:
df[["account", "city", "Jan"]].head(3)

   account            city    Jan
0   211829      New Jaycob  10000
1   320563   Port Khadijah  95000
2   648336  New Lilianland  91000

reindex

In [96]:
df.index=df["account"]
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [97]:
del df["account"] # 컬럼 단위 삭제 
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [103]:
df.index=list(range(0,15)) # merge가 없을 경우 
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [98]:
df[["name", "street"]][:2] # Basic

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [101]:
df.loc[[211829,320563],["name", "street"]]    # loc

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [100]:
df.iloc[:2,:2]  # iloc selection

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

- row 단위 삭제

In [106]:
df.drop(1)[:3]

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000

In [108]:
df.drop([1,2,3])[:4]

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000

In [110]:
df.drop("city", axis=1).head()

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

In [111]:
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [112]:
df.drop("city", axis=1, inplace=True)
df.head()

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

6. Series addtion operation

In [113]:
s1 = Series(
    range(1,6), index=list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [114]:
s2 = Series(
    range(5,11), index=list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [115]:
s1 + s2 # index가 동일한 경우에만 연산을 수행하고 나머지는 NaN으로 저장

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [116]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

7. dataframe opertion
    - add, sub, div, mul

In [117]:
df1 = DataFrame(
    np.arange(9).reshape(3,3), 
    columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [118]:
df2 = DataFrame(
    np.arange(16).reshape(4,4), 
    columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [119]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [123]:
df1.add(df2,fill_value=0) # fill_value - NAN 제거

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

8. operations for dataframe with series
    - Series + DataFrame -> broadcasting

In [124]:
df = DataFrame(
    np.arange(16).reshape(4,4), 
    columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [125]:
s = Series(
    np.arange(10,14), 
    index=list("abcd")) # index가 같은 경우
s

a    10
b    11
c    12
d    13
dtype: int64

In [126]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [137]:
s1 = Series(
    np.arange(10,14), 
    index=list("1bdg")) # index가 있는 경우
s1

1    10
b    11
d    12
g    13
dtype: int64

In [138]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [127]:
s2 = Series(np.arange(10,14)) # index가 없는 경우
s2

0    10
1    11
2    12
3    13
dtype: int64

In [128]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [129]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [136]:
df.add(s2, axis=1)

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [135]:
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

8. lambda

In [145]:
# 함수
def f(x , y): 
    return x + y
f(1,4)

5

In [146]:
# 람다
f = lambda x,y: x + y
f(1,4)

5

In [148]:
f = lambda x : x**2
f(3)

9

In [149]:
f = lambda x: x+5
f(3)

8

In [151]:
(lambda x : x+5)(3)

8

9. Map

In [152]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
list(map(f, ex))

[1, 4, 9, 16, 25]

In [153]:
f = lambda x, y: x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

In [154]:
list(map(lambda x: x+5, ex)) 
#python 3에는 list를 꼭 붙여줘야함

[6, 7, 8, 9, 10]

In [155]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [156]:
s1.map(lambda x: x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [158]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [159]:
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [160]:
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [161]:
s2 = Series(np.arange(10,20))
s1.map(s2)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [164]:
df = pd.read_csv("temp/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [165]:
df.sex.unique()

array(['male', 'female'], dtype=object)

- 분석 시, text to number 방법1. map

In [166]:
df["sex_code"] =  df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

- 분석 시, text to number 방법2. replace

In [167]:
df.sex.replace(
    {"male":0, "female":1}
).head()

/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/1769606335.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.sex.replace(

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [168]:
df.sex.head(5)

0      male
1    female
2    female
3    female
4    female
Name: sex, dtype: object

In [169]:
df.sex.replace(
    ["male", "female"], 
    [0,1], inplace=True)

/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/1249545054.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.sex.replace(
/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/1249545054.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.sex.replace(

In [170]:
df

              earn  height  sex   race  ed  age  sex_code
0     79571.299011   73.89    0  white  16   49         0
1     96396.988643   66.23    1  white  16   62         1
2     48710.666947   63.77    1  white  16   33         1
3     80478.096153   63.22    1  other  16   95         1
4     82089.345498   63.08    1  white  17   43         1
...            ...     ...  ...    ...  ..  ...       ...
1374  30173.380363   71.68    0  white  12   33         0
1375  24853.519514   61.31    1  white  18   86         1
1376  13710.671312   63.64    1  white  12   37         1
1377  95426.014410   71.65    0  white  12   54         0
1378   9575.461857   68.22    0  white  12   31         0

[1379 rows x 7 columns]

In [171]:
del df["sex_code"]

In [172]:
df

              earn  height  sex   race  ed  age
0     79571.299011   73.89    0  white  16   49
1     96396.988643   66.23    1  white  16   62
2     48710.666947   63.77    1  white  16   33
3     80478.096153   63.22    1  other  16   95
4     82089.345498   63.08    1  white  17   43
...            ...     ...  ...    ...  ..  ...
1374  30173.380363   71.68    0  white  12   33
1375  24853.519514   61.31    1  white  18   86
1376  13710.671312   63.64    1  white  12   37
1377  95426.014410   71.65    0  white  12   54
1378   9575.461857   68.22    0  white  12   31

[1379 rows x 6 columns]

10. apply & applymap

In [173]:
df_info = df[["earn", "height","age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [174]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [175]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [176]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [177]:
def f(x):
    return Series([x.min(), x.max(), x.mean()], 
                    index=["min", "max", "mean"])
df_info.apply(f)

               earn    height        age
min      -98.580489  57.34000  22.000000
max   317949.127955  77.21000  95.000000
mean   32446.292622  66.59264  45.328499

In [178]:
f = lambda x : -x
df_info.applymap(f).head(5)  # data frame에 applymap 적용 예

/var/folders/5l/q9m2ygdd0fs67kzmsn_0s__w0000gp/T/ipykernel_5660/3724995950.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [180]:
f = lambda x : -x
df_info["earn"].apply(f).head(5) # Series에 apply 적용 예

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

11. Built-in functions

In [181]:
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

In [182]:
df.describe()

                earn       height          sex           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640     0.622915    13.354605    45.328499
std     31257.070006     3.818108     0.484832     2.438741    15.789715
min       -98.580489    57.340000     0.000000     3.000000    22.000000
25%     10538.790721    63.720000     0.000000    12.000000    33.000000
50%     26877.870178    66.050000     1.000000    13.000000    42.000000
75%     44506.215336    69.315000     1.000000    15.000000    55.000000
max    317949.127955    77.210000     1.000000    18.000000    95.000000

In [183]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [184]:
# dict type으로 index
dict(enumerate(sorted(df["race"].unique())))

{0: 'black', 1: 'hispanic', 2: 'other', 3: 'white'}

In [185]:
# label index 값과 label 값 각각 추출
value = list(map(int, np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

In [193]:
# label str index 값으로 변환
df["race"].replace(to_replace=key, value=value, inplace=True)
df["race"]

0       0
1       0
2       0
3       1
4       0
       ..
1374    0
1375    0
1376    0
1377    0
1378    0
Name: race, Length: 1379, dtype: int64

In [194]:
# 성별에도 동일하게 적용 
value = list(map(int, np.array(list(enumerate(df["sex"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["sex"].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['0', '1'])

In [195]:
# "sex"와 "race" column의 index labelling

df["sex"].replace(to_replace=key, value=value, inplace=True) 
df.head(5)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   66.23    1     0  16   62
2  48710.666947   63.77    1     0  16   33
3  80478.096153   63.22    1     1  16   95
4  82089.345498   63.08    1     0  17   43

In [196]:
df.sum(axis=0)

earn      4.474344e+07
height    9.183125e+04
sex       8.590000e+02
race      5.610000e+02
ed        1.841600e+04
age       6.250800e+04
dtype: float64

In [197]:
df.sum(axis=1)

0       79710.189011
1       96542.218643
2       48824.436947
3       80654.316153
4       82213.425498
            ...
1374    30290.060363
1375    25019.829514
1376    13824.311312
1377    95563.664410
1378     9686.681857
Length: 1379, dtype: float64

In [198]:
df.isnull()

       earn  height    sex   race     ed    age
0     False   False  False  False  False  False
1     False   False  False  False  False  False
2     False   False  False  False  False  False
3     False   False  False  False  False  False
4     False   False  False  False  False  False
...     ...     ...    ...    ...    ...    ...
1374  False   False  False  False  False  False
1375  False   False  False  False  False  False
1376  False   False  False  False  False  False
1377  False   False  False  False  False  False
1378  False   False  False  False  False  False

[1379 rows x 6 columns]

In [199]:
df.isnull().sum(0)

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

In [200]:
df.sort_values(["age", "earn"], ascending=False).head(10)

              earn  height  sex  race  ed  age
3     80478.096153   63.22    1     1  16   95
809   42963.362005   72.94    0     0  12   95
331   39169.750135   64.79    1     0  12   95
102   39751.194030   67.14    0     0  12   93
993   32809.632677   59.61    1     1  16   92
1017   8942.806716   62.97    1     0  10   91
1192  39757.947210   64.79    0     0  16   90
952    8162.682672   58.09    1     0   5   89
827   55712.348432   70.13    0     0   9   88
939   40744.874765   59.15    1     0  15   87

In [201]:
df.cumsum().head(5)

            earn  height  sex  race  ed  age
0   79571.299011   73.89    0     0  16   49
1  175968.287654  140.12    1     0  32  111
2  224678.954602  203.89    2     0  48  144
3  305157.050754  267.11    3     1  64  239
4  387246.396253  330.19    4     1  81  282

In [202]:
df.cummax().head(10)

           earn  height  sex  race  ed  age
0  79571.299011   73.89    0     0  16   49
1  96396.988643   73.89    1     0  16   62
2  96396.988643   73.89    1     0  16   62
3  96396.988643   73.89    1     1  16   95
4  96396.988643   73.89    1     1  17   95
5  96396.988643   73.89    1     1  17   95
6  96396.988643   73.89    1     1  17   95
7  96396.988643   73.89    1     1  17   95
8  96396.988643   73.89    1     2  17   95
9  96396.988643   73.89    1     2  17   95

In [203]:
df.sort_values("age", ascending=False).head(10)

              earn  height  sex  race  ed  age
3     80478.096153   63.22    1     1  16   95
331   39169.750135   64.79    1     0  12   95
809   42963.362005   72.94    0     0  12   95
102   39751.194030   67.14    0     0  12   93
993   32809.632677   59.61    1     1  16   92
1017   8942.806716   62.97    1     0  10   91
1192  39757.947210   64.79    0     0  16   90
952    8162.682672   58.09    1     0   5   89
827   55712.348432   70.13    0     0   9   88
1068  10861.092284   64.03    1     0  13   87

In [204]:
df.age.corr(df.earn)

0.07400349177836058

In [205]:
df.age[(df.age<45) & (df.age>15)].corr(df.earn)

0.3141178872518904

In [206]:
df.age.cov(df.earn)

36523.6992104089

In [207]:
df.corr()

            earn    height       sex      race        ed       age
earn    1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727
sex    -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036
race   -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000

In [208]:
df.corrwith(df.earn)

earn      1.000000
height    0.291600
sex      -0.337328
race     -0.063977
ed        0.350374
age       0.074003
dtype: float64

In [209]:
df.sex.value_counts(sort=True)

sex
1    859
0    520
Name: count, dtype: int64